#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}


//int main()
//{
//	//正数的二进制位反码、补码是本身原码
//	int a = 20;//4个字节-32个bit位
//	//00000000000000000000000000010010-原码
//	//00000000000000000000000000010010-反码
//	//00000000000000000000000000010010-补码
//	//转换16进制位，4个bit位计算一个-0x表示16进制
//	//0000 0000 0000 0000 0000 0000 0001 0010
//	//0x 00000014
//	int b = -10;
//	//原码、反码、补码不同，需要计算
//	//10000000000000000000000000001010-原码
//	//11111111111111111111111111110101-反码
//	//11111111111111111111111111110110-补码
//	//转换16进制位
//	//1111 1111 1111 1111 1111 1111 1111 0110
//	//0x fffffff6
//	return 0;
//}



//2015百度面试题
//写一段代码告诉我们当前机器的字节序是什么？
//#include <stdio.h>
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;//强制类型转换
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//函数封装
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;//强制类型转换
//	if (*p == 1)
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;//强制类型转换
//	//返回1 小端
//	//返回0 大端
//	return *p;
//}

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;//强制类型转换
//	//返回1 小端
//	//返回0 大端
//}
////指针类型的意义
////1.决定了指针解引用操作符能访问几个字节（char1）（int4）
////2.决定了指针+1/-1的时候加减几个字节（char跳过一个字节）（int跳过一个整形）
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//输出是什么？
//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	signed char b = -1;//有符号数
//	//11111111
//	unsigned char c = -1;//无符号数
//	//00000000000000000000000011111111
//	//255
//	printf("%d\n%d\n%d\n", a, b, c);
//	//-1 -1 255
//	return 0;
//}



//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000-原码
//	//11111111111111111111111101111111-反码
//	//11111111111111111111111110000000-补码
//	//char是短整型，取一个字节
//	//10000000
//	//%u打印整形，补齐
//	//11111111111111111111111110000000-补码
//	//反码
//	//10000000000000000000000010000000原码
//	printf("%u\n", a);//%u-打印十进制的无符号数字
//	printf("%d\n", a);//%d-打印十进制的有符号数字
//	return 0;
//}



//int main()
//{
//	char a = 128;
//	printf("%u\n", a);//%u-打印十进制的无符号数字
//	printf("%d\n", a);//%d-打印十进制的有符号数字
//	return 0;
//}


//int main()
//{
//	int i= -20;
//	unsigned int j = 10;
//	printf("%d\n", i+j);//-10
//	return 0;
//}

//#include<windows.h>
//int main()
//{
//	unsigned int i = 9;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}


//int main()
//{
//	char a[1000];
//	int i = 0;
//	for (i = 0; i< 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));
//	return 0;
//}


int main()
{
	unsigned char i = 0;
	for (i = 0; i <= 255; i++)
	{
		printf("hh\n", i);//无限制循环
	}
	return 0;
}